1.  192.168.10.0/20 ցանցի մեջ քանի համակարգիչ կարող է լինել։ Որոնք են առաջին և վերջին համակարգիչների IP հասցեները։      Done
    2^9 - 2 = 4096 - 2 = 4094 
    first ID   192.168.0.1     
    second ID  192.168.15.254

2.  A դասի ցանցի մեջ եթե 3 բիթ օգտագործենք ենթացանցի համար, ինչպիսին կլինի subnet mask֊ը։      Done
    255.224.0.0

3.  Եթե subnet mask֊ը 255․255․255․224 է, քանի համակարգիչ կարող է լինել այդ ցանցի մեջ։       Done
    2^5 - 2 = 30 

4.  Ստեղծեք սոկետ տիպի նիշք և ձեր համակարգչի և վիրտուալ մեքենայի տերմինալների միջոցով չատ ստեղծեք։      Done

    1. first variant
       write
       write anna ----- (username)

    2. second variant
       nc -l 12455 ----- it is written in the first terminal (12455 - random number)
       nc 192.168.1.200 12455 ----- it is written in the first terminal
       After that you can start the chat.
 
    3. third variant
       ssh (host name) -p (port number)

5.   Որ նիշքում պետք է պահել SSH-ով կապ հաստատելու ժամանակ գեներացված բանալին, որպեսզի նույն համակարգչին կարողանան միանալ նաև մեր համակարգչի մեջ եղած այլ օգտատերերը։        Done
    ~/.ssh/id_rsa.pub

6.  Ընկերությունն ունի 4 մասնաճյուղ Հայաստանի տարբեր քաղաքներում և ցանկանում է իր 53․27․22․0/23 ցանցը բաժանել 4 ենթացանցի   հետևյալ համամասնությամբ։        Done

      Գյումրի – 63 սարք
      Աշտարակ – 22 սարք
      Երևան – 100 սարք
     Վանաձոր – 58 սարք

   1. Նշեք ամեն ենթացանցի հասցեն և քողը
   2․ Եթե կրկնապատկենք միայն Երևանի մասնաճյուղի սարքերի քանակը (դարձնենք 200, իսկ մնացած մասնաճյուղերինը թողնենք նույնը), ամեն մի մասնաճյուղ կարող է իր ենթացանցն ունենալ։ Պատասխանը հիմնավորեք։
   3․ Եթե նախնական վիճակի համեմատ կրկնապատկենք միայն Երևանի ու Գյումրիի սարքերի թիվը (դարձնելով համապատասխանաբար 200 և 126), իսկ մնացած մասնաճյուղերինը թողնենք նույնը, ամեն մի մասնաճյուղ կարող է իր ենթացանցն ունենալ։ Պատասխանը հիմնավորեք։
   4․ Եթե նախնական վիճակի համեմատ կրկնապատկենք բոլոր մասնաճյուղերի սարքերի թիվը, դարձնելով համապատասխանաբար 126, 44, 200, 116, ամեն մի մասնաճյուղ կարող է իր ենթացանցն ունենալ։ Պատասխանը հիմնավորեք։

    1.  Ենթացանցերի քողերը.
        255.255.255.128 - Գյումրի
        255.255.255.128 - Երևան
        255.255.255.192 - Վանաձոր 
        255.255.255.224 - Աշտարակ

              Ենթացանցերի  հասցեները.
        53․27․22․1 - 53․27․22․126 - Գյումրի – 63 սարք
	53․27․22․127 - 53․27․22․255 - Վանաձոր – 58 սարք
	53․27․23․1 - 53․27․23․126 -   Երևան 100 սարք
	53․27․23․127 - 53․27․23․255 - Աշտարակ – 22 սարք


    2.  Ենթացանցերի քողերը.
        255.255.255.128 - Գյումրի
        255.255.255.0 - Երևան
        255.255.255.192 - Վանաձոր 
        255.255.255.224 - Աշտարակ

              Ենթացանցերի  հասցեները.
        53․27․22․1 - 53․27․22․126 - Գյումրի – 63 սարք
	53․27․22․127 - 53․27․22․255 - Վանաձոր – 58 սարք
	53․27․23․1 - 53․27․23․200 - Երևան 200 սարք
	53․27․23․201 - 53․27․23․255 - Աշտարակ – 22 սարք
        
        Քանի որ  այս դեպքում (53․27․22․0/23) քողը /23 է (կամ որ նույնն է՝ 255.255.254.0), ապա ցանցում կարող ենք ունենալ 2^9 - 2 = 510 սարք,
        իսկ մեր սարքերի ընդհանուր թիվը կլինի 63 + 58 + 200 + 22 = 343 , ապա ամեն մի մասնաճյուղ կարող է իր ենթացանցն ունենալ։

    3.  Ենթացանցերի քողերը.
        255.255.255.128  Գյումրի – 126 սարք
        255.255.255.0  Երևան - 200 սարք
        255.255.255.192 - Վանաձոր – 58 սարք
        255.255.255.224 -  Աշտարակ – 22 սարք

              Ենթացանցերի  հասցեները.
        53․27․22․1 - 53․27․22․126 - Գյումրի
	53․27․22․127 - 53․27․22․255 - Վանաձոր
	53․27․23․1 - 53․27․23․200 - Երևան
	53․27․23․201 - 53․27․23․255 - Աշտարակ

       Սարքերի հնարաոր առավելագույն քնակը - 510
       Ընդհանուր սարքերի թիվը - 126 + 200 + 58 + 22 = 406
     

    4.  Ենթացանցերի քողերը.
        255.255.255.128  Գյումրի – 126 սարք
        255.255.255.0  Երևան -200 սարք
        255.255.255.128 - Վանաձոր - 116 սարք
        255.255.255.192 - Աշտարակ - 44 սարք

              Ենթացանցերի  հասցեները.
        53․27․22․1 - 53․27․22․126 - Գյումրի
	53․27․22․127 - 53․27․22․255 - Վանաձոր
	53․27․23․1 - 53․27․23․200 - Երևան
	53․27․23․201 - 53․27․23․255 - Աշտարակ

       Սարքերի հնարաոր առավելագույն քնակը - 510
       Ընդհանուր սարքերի թիվը - 126 + 200 + 116 + 44 = 486










