2019.04.09

4. Որ նիշքի մեջ և ինչպես կարելի է փոխել grub-ի պատուհանի մեջ եղած անվանումները, օրինակ Ubuntu֊ի փոխարեն գրել Ubuntu 16․04 կամ այլ ցանկացած բան։

GRUB-DISTRIBUTOR="Ubuntu 16.04"

2019.04.10

12. Ստեղծել նիշք, որի մեջ 5 տողում ամեն տողում մեկ անգամ գրված կլինի Linux և այդ նիշքի պարունակությունը դուրս բերել տերմինալ այնպես, որ բոլոր տողերում գրվածը, բացի 3-րդ տողից փոխի և գրված լինի Ubuntu:

echo 'linuxlinuxlinuxlinuxlinux' | fold -w 5 | tee anna.txt
cat anna.txt | sed '1,2s/linux/ubuntu/' | sed '4,5s/linux/ubuntu/'





